{"is404":false,"staticData":{"321169480":"[\"content/blog/faux-controlled-components.md\"]","1242532777":"{\"parsedFrontmatter\":{\"title\":\"Faux-Controlled Components\",\"img_url\":\"images/npm.jpg\",\"img_alt\":\"Faux-Controlled Components\",\"date\":\"2022-05-13\",\"seo_description\":\"Faux-Controlled Components: What my team learned about React's useMemo after spending 2 days fixing npm's worst React calendar component.\",\"summary\":\"What my team learned after spending 2 days fixing npm's worst React calendar component.\",\"tags\":[\"react\"],\"hidden\":false},\"withoutFrontmatter\":\"\\n![Node Package Manager](images/npm.jpg)\\n\\n# Faux-Controlled Components\\n\\nMy team recently spent the best part of two days debugging a React component.\\nThe bug was caused by what I'd describe as a **Faux-Controlled Component**, and was solved by `useMemo`-ing one of its props.\\nIt provides a useful case study for people (like myself) who **think they understand React, but do not**.\\n\\n## Part 1: Equality\\n\\nLet's take a tour of the [most popular programming languages](https://tjpalmer.github.io/languish/) and see how their **`==`** operator compares two lists, both containing the number one. (I'm aware critique of JavaScript's equality rules is cliché, but I promise it's relevant).\\n\\n**_Go:_** ✅\\n```go\\nxs := [1]int{}\\nys := [1]int{}\\n\\nxs == ys // true\\n```\\n\\n**_Java:_** ❌\\n```java\\nint[] xs = { 1 };\\nint[] ys = { 1 };\\n\\nxs == ys; // false\\n```\\n\\n**_Python:_** ✅\\n```python\\n> xs = [1]\\n> ys = [1]\\n> xs == ys\\nTrue\\n```\\n\\n**_JavaScript:_** ❌\\n```python\\n> let xs = [1]\\n> let ys = [1]\\n> xs == ys\\nfalse\\n```\\n\\nA lot of disagreement about something quite simple!\\n\\nWhile perhaps not as intuitive, I wouldn't say Java and JS are **\\\"wrong\\\"** here. Is the list on the left __'the same as'__ the list on the right? They have the same content, but that doesn't really make them *__the same list__*. You could change the number in `xs`, and it wouldn't change in `ys`. In this way they are two distinct entities.\\n\\nIn fact, if it wasn't for JavaScript's ability to quickly check if two things are exactly 'the same thing', React's fast rendering wouldn't be possible! I'll come back to the importance of this later.\\n\\n## Part 2: Lies I've Told About `useMemo`\\n\\nHere is a slide from a training I've given about React Hooks:\\n\\n---\\n\\n**useMemo** - Don't use it everywhere!\\n\\nIf the operation is **cheap**, there's **no point**.\\n\\n❌ `const first = useMemo(() => items[0], [items]);` ❌\\n\\n✅ `const first = items[0];` ✅\\n\\n---\\n\\nWhat's the lie here?\\n\\nSome operations are **cheap**, but a `useMemo` will still have an effect.\\n\\nIn the same way `useCallback` does, `useMemo` ensures that, given that the old dependency array 'equals' the new dependency array, we keep the same memory address. This is important if you're passing props down to `memo`-ized components, to avoid unnecessary re-renders when nothing has changed.\\n\\nFor some expressions, `useMemo` does not make any difference. Here are some examples of `useMemo` being applied **_wrongly_**, as the memory address would remain the same without it:\\n\\n```javascript\\n// accessing an array index: you always get the same address\\nconst x = useMemo(() => xs[0], [xs]);\\n```\\n\\n```javascript\\n// arithmetic: numbers are compared based on their value\\nconst x = useMemo(() => 100 * 100 + 100, []);\\n```\\n\\n```javascript\\n// calls that return strings: strings are compared based on their value\\nconst name = useMemo(() => person.getName(), [person]);\\n```\\n\\nFor others, useMemo does matter. Here are some examples when `useMemo` **_was needed_** (but forgotten):\\n\\n```javascript\\n// putting something in an array: a new array is created every time\\n// even though this is a simple operation, unless useMemo'd\\n// it will return a new object every time!\\nconst xs = [x];\\n```\\n\\n```javascript\\n// constructing an object... same as above\\nconst person = { age: 101 };\\n```\\n\\nSo how could I fix the slide? We need to add another condition:\\n\\n---\\n\\n**useMemo** - Don't use it everywhere!\\n\\nIf the operation is:\\n- **cheap**\\n- **_AND returns the same address every time_**\\n\\nThere's **no point**.\\n\\n❌ `const first = useMemo(() => items[0], [items]);` ❌\\n\\n✅ `const first = items[0];` ✅\\n\\n---\\n\\nMost misuses of `useMemo` go unnoticed, and most of the time, misusing it doesn't matter much. Why? Re-renders in React are usually cheap, and won't cause a *real* re-render in the DOM unless something actually changed.\\n\\nIt's almost not worth the developer's time to apply `useMemo` correctly - a pretty dangerous notion, as mistakes can be very hard to fix.\\n\\n## Part 3: Je Déteste Faux-Controlled Components\\n\\nThe [React documentation](https://reactjs.org/docs/uncontrolled-components.html) defines *'Uncontrolled Components'* as components controlled by *data in the DOM*, not a React Component. It's conventional wisdom that they should be avoided at all costs.\\n\\nHowever, the _'Controlled/Uncontrolled Binary'_ isn't quite as black and white as this definition implies. When you're using components you've downloaded from npm, you might stumble upon a _**'Faux-Controlled Component'**_. _**'Faux-Controlled Components'**_ are React Components which, while their state is not stored in the DOM, hides state from the developer & keep the issues of Uncontrolled Components as a result.\\n\\nAn example of a 'Faux-Controlled Component' is [`react-date-range`'s `DateRange`](https://www.npmjs.com/package/react-date-range). Looking at the docs, things don't seem too bad:\\n\\n```javascript\\nconst App = () => {\\n  const [ranges, onChange] = useState(/*...*/);\\n\\n  return (\\n    <div>\\n      <DateRange onChange={onChange} ranges={ranges} />\\n    </div>\\n  );\\n}\\n```\\n\\n**The `DateRange` is controlled!** The user can pass down state and a callback, giving us complete control of the component. Before you can say '`yarn add`' I've made `react-date-range` (and its dependencies) a part of my website forever.\\n\\nBut was I too hasty? What about these **month arrows**?\\n\\n![Those Month Arrows](images/month-arrows.png)\\n\\nThese buttons flip the DateRange from one month to the next... The DateRange clearly has some **more state than just '`date`'**. It's not nearly as *Controlled* as I first thought!\\n\\nWhat happens if I want those 'shown date' buttons to behave in any other way?\\n\\nI could want my `DateRange` to:\\n - Only allow the user to view **dates in the future**\\n - Move forward **2 months at a time**\\n - Click a button **outside the DateRange** to advance it\\n - Perform an **action**, such as a network request, **whenever the user changes month**\\n\\nThe library attempts to provide a fix for the first shortcoming: `minDate` and `maxDate` props. In fact, the component has **over 40 props**, almost all of which are optional. Most of them provide a way to slightly change the behaviour of the component.\\n\\nWhy not let me use my own state, and have `shownDate` and `onShownDateChange` props? Well, we almost do! Except the docs describe `shownDate` as the \\\"initial focused date\\\". Unfortunately, it only controls which value the **internal** state is __*initialised to*__. This is a **_Faux-Controlled Prop!_**\\n\\nIt's hard to tell why `DateRange` was designed this way. I would consider this bad API design, but perhaps it's a good fit for the audience. Faux-Controlled Components can be a handy tool for **lazy developers** who **don't want to think about the complexity** they are introducing to their application. They'd rather the library handled all this state for them, to save them 'wiring up' 5 or 6 different state values & callbacks when they include complex components.\\n\\nThis is a cowardly attitude. We should meet this complexity head on - if you're adding state to your application, you **must** consider its implications. Don't let library authors hide it from you. Library authors compete in the npm market - whichever library's front-page code snippet looks simplest will undoubtedly win the most downloads. But what is this faux-simplicity hiding?\\n\\n## Part 4: Betrayal\\n\\n**So what?** Maybe _Faux-Controlled Components_ are less customizable. Big deal - 99% of developers just want a DateRange that _'does what it says on the tin'_.\\n\\nThis is where _Faux-Controlled Components_ reveal their true problem: unless you treat them with extreme care, they **will betray you**.\\n\\nReturning to our case study, I needed to grey out unavailable dates. As the user advanced through the calendar, I had to ask the backend which dates were available in the month they have on screen. While I can't directly know the Calendar's `shownMonth`, I can use `onShownDateChange` and my **own state** to keep track of the month shown. This isn't ideal, but it's enough for now.\\n\\nI add my callback to `onShownDateChange`, and suddenly my DateRange is stuck - the _Next_ button doesn't do anything!\\n\\nA minimal example demonstrating this bug is shown below [(also on CodePen)](https://codepen.io/findlang/pen/xxYRzpO):\\n\\n```javascript\\nconst range = {\\n  startDate: new Date(),\\n  endDate: new Date()\\n};\\n\\nconst App = () => {\\n  return (\\n    <DateRange\\n        onShownDateChange={/* setState & re-render */}\\n        ranges={[range]}\\n    />\\n  );\\n};\\n```\\n\\nThere are two important things to note about this code:\\n - `onShownDateChange` causes a re-render, as it calls a React `setState` function.\\n - `ranges` is set to a new array every time. As discussed in Part 1, creating an array literal outside of a `useMemo` will make a new object (with a distinct memory address) **every single time the code is run**.\\n - `DateRange` is a _Faux-Controlled Component_\\n\\nThese 3 properties come together to create a perfect storm, and the _Next_ button on the DateRange stops working.\\n\\nWhy?\\n- We press _Next_\\n- So `onShownDateChange` is called\\n- So `setState` is called\\n- So `App` is re-rendered\\n- So `[range]` gets a **new memory address**, even though its value is the same\\n- So `DateRange` shows this 'new' (but not really new) range\\n- ... Sending us back to the initial month\\n\\nSending the user **back to the original month** gives the illusion that the _Next_ button does not work. Why are we sent back to the original month? Whenever `ranges` is set to a 'new' value, `DateRange` decides to show that month. We let it manage its own `shownMonth` state, and this is what it has decided to do with it. If we controlled the `shownMonth` state, this wouldn't be an issue.\\n\\nTo fix this, we can wrap `[range]` in a `useMemo`.\\n\\n```javascript\\nconst range = {\\n  startDate: new Date(),\\n  endDate: new Date()\\n};\\n\\nconst App = () => {\\n  const ranges = useMemo(() => [range], [range]);\\n\\n  return (\\n    <DateRange\\n        onShownDateChange={/* setState (rerender) */}\\n        ranges={ranges}\\n    />\\n  );\\n};\\n```\\n\\nNow, we can break the chain of events:\\n- We press _Next_\\n- So `onShownDateChange` is called\\n- So `setState` is called\\n- So `App` is re-rendered\\n- ~~So `[range]` gets a **new memory address**, even though its value is the same~~\\n  - The useMemo makes sure `ranges` keeps the same memory address, as `range` is the same\\n\\nNot exactly elegant, but at least it works!\\n\\n## Conclusion\\n\\nHow can we prevent this from happening? We must avoid using (& publishing) Faux-Controlled Components at all costs!\\n\\nUnfortunately React programmers love to **hide** state - they even call it 'Component Driven' design and act like it's a good idea. Of course, it's not without merit - allowing devs to drop cute little components into their app without having to 'wire them up' with state is an appealing concept, and most of the time it seems to work without any hiccups.\\n\\nThe sad reality is that **hiding state** inside components is React's biggest strength, and also its biggest weakness. Most of the nasty bugs and design problems I see in React applications stem from this ability. If state is hidden in the corners of your application, **distributed across hundreds of tiny components**, what hope do you have of keeping your sanity when transitioning the application from one state to the other?\\n\\nIn this sense, React's main competitor is the frontend language [Elm](https://elm-lang.org/). Looking at Elm's design offers us some insight here, as Elm **forbids storing state anywhere but the top level** of your app (think about it like Redux-only architecture).\\n\\nThis design shows us the downside of prohibiting 'state-hiding' - anyone who has written even a small app in Elm knows the amount of 'wiring', passing values between parent and child components, can be exhausting. As a famous man once said: _\\\"While the State exists, there can be no freedom. When there is freedom there will be no State.\\\"_\\n\"}"},"path":"faux-controlled-components"}